app/controllers/authors_controller.rb

SELECT `authors`.* FROM `authors`
---
  def index
    @authors = Author.all

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 9 LIMIT 1
---
  def show
    @author = Author.find(params[:id])

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
---
  def edit
    @author = Author.find(params[:id])

INSERT INTO `authors` (`created_at`, `first_name`, `last_name`, `updated_at`, `user_id`) VALUES ('2013-03-30 00:03:22', 'dfdf', 'dfdf', '2013-03-30 00:03:22', 1)
---
  def create
    @author = Author.new(params[:author])
    respond_to do |format|
      if @author.save

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
---
  def update
    @author = Author.find(params[:id])

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
DELETE FROM `authors` WHERE `authors`.`id` = 1
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy