app/controllers/citations_controller.rb

SELECT `citations`.* FROM `citations`
---
  def index
    @citations = Citation.all