app/controllers/dashboard_controller.rb

  def dataentry
  @author = Author.new
  @authorlist = Author.all
  @citation = Citation.new
  @citationlist = Citation.all
---
SELECT `authors`.* FROM `authors`
SELECT `citations`.* FROM `citations`