app/controllers/home_controller.rb

SELECT `locations`.* FROM `locations`
---
  def index
  	@json = Location.all.to_gmaps4rails