app/controllers/visualization_controller.rb

def index
 @chart = LazyHighCharts::HighChart.new('graph') do |f|
    f.title({ :text=>"Foodweb Ladder Rankings"})
    f.options[:xAxis][:categories] = ['Citations']
User.find_each do |user|
f.series(:type=> 'column',:name=> user.email,:data=> [Citation.where(:user_id => user.id ).count ])
---
SELECT COUNT(*) FROM `citations` WHERE `citations`.`user_id` = 2